{
  "work": [
    {
      "company": "Advanced",
      "title": "Principal DevOps Architect",
      "years": "June 2021 - Present",
      "icon": "work",
      "details": [
        "Core involvement in defining the company go forward Cloud migration strategy",
        "Designing and building SaaS solutions using AWS",
        "Creating tooling and best practice to help accelerate development teams"
      ],
      "technologies": [
        "AWS",
        "Javascript",
        "Node.js"
      ]
    },
    {
      "company": "Advanced",
      "title": "ERP Architect",
      "years": "March 2018 - May 2021",
      "icon": "work",
      "details": [
          "Leading projects with a team of developers in different locations to ensure all functionality is delivered as specified, on time and to a high quality",
          "Mentoring and supporting teams with different skill sets and experience who are located in different locations",
          "Software and database design and implementation on several different technologies i.e. Node.js, React, PostgresSQL, Progress 4GL and MS SQL",
          "Assisting other teams with migration to cloud based systems i.e. on-premise to cloud based on AWS",
          "Research & Development on new functionality/features/technologies including Voice (Alexa/Google Assistant), Chatbots, AI/ML and AR/Augmented Reality",
          "Part of the company software architecture team. Involved in deciding how the company moves forward from a technology and architecture point of view. This will impact all teams, totalling 500+ developers and 100+ applications",
          "Part of the company devops community of practice. Involved in helping increase devops awareness, best practice and engagement throughout the company"
      ],
      "technologies": [
        "Node.js",
        "React",
        "Docker",
        "AWS",
        "Postgres",
        "Progress OpenEdge"
      ]
    },
    {
      "company": "Advanced",
      "title": "Principal Software Developer",
      "years": "November 2012 - February 2018",
      "icon": "work",
      "details": [
        "Assisting with specifications and coding of new modules on an award-winning payroll system used to pay thousands of people around the UK. This needs to be strictly compliant with HMRC rules and regulations",
        "Leading Projects with a team of 12 developers to ensure all functionality is delivered as specified, on time and to a high quality. Including managing work outsourced to India",
        "Mentoring graduates and other team members who are located both in-house and overseas",
        "Database design and implementation on several different database technologies i.e. Progress 4GL, MS SQL and PostgresSQL. ",
        "Lead in key technical related issues. This includes managing development, build and release environments for the entire team. This was achieved using technologies such as Subversion/Github, Ant, Jenkins, Octopus Deploy, Docker and Amazon AWS. Including external release deployment using Installshield",
        "Helping improve and implement better overall processes i.e. Development workflows and Agile development methodologies (Scrum). ",
        "Analysing maintenance issues and providing a quick and efficient turnaround based on customer expectation. Including customer escalations as required and performance tuning",
        "Research & Development on new functionality/features/technologies including hybrid mobile development",
        "Part of the company software architecture team consisting of 15 individuals. Involved in deciding how the company moves forward from a technology, devops and architecture point of view. This will impact all teams, totalling 500+ developers and 100+ applications",
        "General Application and Hardware support for Development/QA team"
      ],
      "technologies": [
        "Progress OpenEdge",
        "SQL Server",
        "C#",
        "Java",
        "Node.js",
        "Angular",
        "Docker"
      ]
    },
    {
      "company": "Advanced",
      "title": "Senior Developer",
      "years": "November 2010 - November 2012",
      "icon": "work",
      "details": [
        "Assisting with specifications and coding new modules on a payroll system used to pay hundreds of thousands of people around the UK. This needs to be strictly compliant with HMRC rules and regulations",
        "Database design and implementation on a number of different database technologies including Progress and MSSQL",
        "Dealing with development, build and release environments using subversion. This also includes building releases with Installshield",
        "Analysing maintenance issues and providing a quick and efficient turnaround"
      ],
      "technologies": [
        "Progress OpenEdge",
        "SQL Server",
        "C#",
        "Java"
      ]
    },
    {
      "company": "Achilles Information Ltd (FPAL)",
      "title": "Senior Engineer",
      "years": "May 2009 - November 2010",
      "icon": "work",
      "details": [
        "Creating specifications and coding new modules to change websites used by thousands of Oil & Gas customers around the world",
        "Tracking down and fixing faults in application and database logic. ",
        "Lead developer in a number of applications, which requires a great deal of workload management to ensure that everything is done within the required deadlines",
        "Writing strict standards compliant code in a number of different languages to match company development and quality assurance policies",
        "Part of the company standards team which is used to implement better development standards and software quality processes",
        "General Application and Hardware support"
      ],
      "technologies": [
        "C#",
        "ASP.NET",
        "SQL Server"
      ]
    },
    {
      "company": "Trapeze Group (Formally Grampian Software)",
      "title": "Programmer",
      "years": "June 2006 - May 2009",
      "icon": "work",
      "details": [
        "Maintain and modify programs; make approved changes, develop detailed programming logic, and perform coding changes as per specifications",
        "Create specifications based on customer’s required business logic",
        "Creating and updating documentation to reflect application changes",
        "Investigate, Establish and Resolve faults in application logic",
        "Managing workload and meeting strict deadlines",
        "Database administration and management",
        "General application/desktop support for internal staff"
      ],
      "technologies": [
        "Progress OpenEdge"
      ]
    }
  ],
  "education": [
    {
      "company": "Robert Gordon University",
      "title": "BSc Computing for Internet & Multimedia (Hons)",
      "years": "September 2004 - May 2006",
      "icon": "education",
      "details": [
        "Systems Development",
        "Software Project Engineering",
        "Internet Based Programming & Intranet Systems Development",
        "Object Oriented Programming",
        "Database Systems",
        "Human Computer Interaction",
        "Professional Issues",
        "Concurrent Programming",
        "Data Mining",
        "Concurrent Programming",
        "Project Management",
        "Interactive Multimedia"
      ]
    },
    {
      "company": "Banff and Buchan College",
      "title": "HND Software Development",
      "years": "August 2002 to May 2004",
      "icon": "education",
      "details": [
        "Communication",
        "Concurrent Programming",
        "Introduction to Networking",
        "Software Design and Development",
        "Concurrent Programming",
        "Web Programming",
        "Computer System Fundamentals",
        "Troubleshooting Computer Problems",
        "Professionalism and Ethics in Computing",
        "Data Structures",
        "Introduction to Databases & SQL"
      ]
    }
  ]
}